SH6_43_msh3/system/blockMeshDict
FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters     1;

vertices
(
    (0 -0.2 0)      // 0
    (0 0.2 0)       // 1
    (49.4 -0.2 0)   // 2
    (49.4 0.2 0)    // 3
    (49.8 0.6 0)    // 4
    (50.2 0.6 0)    // 5
    (49.8 39.4 0)   // 6
    (50.2 39.4 0)   // 7
    (50.6 39.8 0)   // 8
    (50.6 40.2 0)   // 9
    (69.4 39.8 0)   // 10
    (69.4 40.2 0)   // 11
    (69.8 39.4 0)   // 12
    (70.2 39.4 0)   // 13
    (69.8 0.6 0)    // 14
    (70.2 0.6 0)    // 15
    (70.6 -0.2 0)   // 16
    (70.6 0.2 0)    // 17
    (220 -0.2 0)    // 18
    (220 0.2 0)     // 19
    (0 -0.2 0.2)    // 20
    (0 0.2 0.2)     // 21
    (49.4 -0.2 0.2) // 22
    (49.4 0.2 0.2)  // 23
    (49.8 0.6 0.2)  // 24
    (50.2 0.6 0.2)  // 25
    (49.8 39.4 0.2) // 26
    (50.2 39.4 0.2) // 27
    (50.6 39.8 0.2) // 28
    (50.6 40.2 0.2) // 29
    (69.4 39.8 0.2) // 30
    (69.4 40.2 0.2) // 31
    (69.8 39.4 0.2) // 32
    (70.2 39.4 0.2) // 33
    (69.8 0.6 0.2)  // 34
    (70.2 0.6 0.2)  // 35
    (70.6 -0.2 0.2) // 36
    (70.6 0.2 0.2)  // 37
    (220 -0.2 0.2)  // 38
    (220 0.2 0.2)   // 39
);

blocks
(
    hex ( 0 2 3 1 20 22 23 21 ) ( 200 5 1 ) 
    simpleGrading
    (
        1
        (
            (10 30 2)
            (80 40 1)
            (10 30 0.5)
        )
        1
    )
    hex ( 2 5 4 3 22 25 24 23 ) ( 20 5 1 ) 
    simpleGrading 
    (
        1
        (
            (10 30 2)
            (80 40 1)
            (10 30 0.5)
        )
        1
    )
    hex ( 5 7 6 4 25 27 26 24 ) ( 200 5 1 ) 
    simpleGrading 
    (
        1
        (
            (10 30 2)
            (80 40 1)
            (10 30 0.5)
        )
        1
    )
    hex ( 7 8 9 6 27 28 29 26 ) ( 20 5 1 ) 
    simpleGrading 
    (
        1
        (
            (10 30 2)
            (80 40 1)
            (10 30 0.5)
        )
        1
    )
    hex ( 8 10 11 9 28 30 31 29 ) ( 100 5 1 ) 
    simpleGrading 
    (
        1
        (
            (10 30 2)
            (80 40 1)
            (10 30 0.5)
        )
        1
    )
    hex ( 10 12 13 11 30 32 33 31 ) ( 20 5 1 ) 
    simpleGrading 
    (
        1
        (
            (10 30 2)
            (80 40 1)
            (10 30 0.5)
        )
        1
    )
    hex ( 12 14 15 13 32 34 35 33 ) ( 200 5 1 ) 
    simpleGrading 
    (
        1
        (
            (10 30 2)
            (80 40 1)
            (10 30 0.5)
        )
        1
    )
    hex ( 14 16 17 15 34 36 37 35 ) ( 20 5 1 ) 
    simpleGrading 
    (
        1
        (
            (10 30 2)
            (80 40 1)
            (10 30 0.5)
        )
        1
    )
    hex ( 16 18 19 17 36 38 39 37 ) ( 600 5 1 ) 
    simpleGrading 
    (
        1
        (
            (10 30 2)
            (80 40 1)
            (10 30 0.5)
        )
        1
    )
);

edges 
(
    arc 2 5 (49.96569 0.034315 0)
    arc 3 4 (49.6824 0.317157 0)
    arc 22 25 (49.96569 0.034315 0.2)
    arc 23 24 (49.6824 0.317157 0.2)

    arc 6 9 (50.03431 39.96569 0)
    arc 7 8 (50.31716 39.68284 0)
    arc 26 29 (50.03431 39.96569 0.2)
    arc 27 28 (50.31716 39.68284 0.2)

    arc 10 12 (69.68284 39.68284 0)
    arc 11 13 (69.96569 39.96569 0)
    arc 30 32 (69.68284 39.68284 0.2)
    arc 31 33 (69.96569 39.96569 0.2)

    arc 14 16 (70.03431 0.034315 0)
    arc 15 17 (70.31716 0.317157 0)
    arc 34 36 (70.03431 0.034315 0.2)
    arc 35 37 (70.31716 0.317157 0.2)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 20 21 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (18 19 39 38)
        );
    }
    sides
    {
        type empty;
        faces
        (
            (20 22 23 21)
            (0 1 3 2)
            (2 3 4 5)
            (22 25 24 23)
            (4 6 7 5)
            (24 25 27 26)
            (6 9 8 7)
            (26 27 28 29)
            (8 9 11 10)
            (28 30 31 29)
            (10 11 13 12)
            (30 32 33 31)
            (12 13 15 14)
            (32 34 35 33)
            (14 15 17 16)
            (34 36 37 35)
            (16 17 19 18)
            (36 38 39 37)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 2 22 20)
            (1 21 23 3)
            (2 5 25 22)
            (3 23 24 4)
            (5 7 27 25)
            (4 24 26 6)
            (7 8 28 27)
            (6 26 29 9)
            (8 10 30 28)
            (9 29 31 11)
            (10 12 32 30)
            (11 31 33 13)
            (12 14 34 32)
            (13 33 35 15)
            (14 16 36 34)
            (15 35 37 17)
            (16 18 38 36)
            (17 37 39 19)
        );
    }
)


mergePatchPairs();
