SH6_43_msh3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       12415;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       12420;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          13800;
        startFace       12425;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2760;
        startFace       26225;
    }
)

// ************************************************************************* //
